import telebot
from telebot import types 

bot = telebot.TeleBot('')


@bot.message_handler(func=lambda message: True)
def handle_all_messages(message):
    code = message.text.strip()

    valid_codes = {
        '123w123oq': '🎁 Ти отримав подарунок: 100.000💵 (zv)',
        '111111': '🎁 Ти отримав подарунок: 500.000💵 (vv)',
        '1231ooh': '🎁 Ти отримав подарунок: 100.000💵 (vv)',
        '103110': '🎁 Ти отримав подарунок: 1.500.000💵 (vv)',
        'bankay': '🎁 Ти отримав подарунок: 150.000💵 (zv)',
        'cont': '🎁 Ти отримав подарунок: Американський контейнер 🗽',
        '18470': '🎁 Ти отримав подарунок: 250.000💵 (zv)',
        'goldcase': '🎁 Ти отримав подарунок: Золотий контейнер 🟡',
        'ukrfree': '🎁 Ти отримав подарунок: 1.000.000💵 (vv)',
        'startbonus': '🎁 Стартовий бонус: 200.000💵 (zv)',
        'military2025': '🎁 Ти отримав подарунок: 500.000💵 (vv) + 10 нових танків 🛡️',
        'airgift': '🎁 Ти отримав подарунок: 5 сучасних літаків F-35 ✈️',
        'secret007': '🎁 Секретний подарунок: 3.000.000💵 (vv) + розвідка 🔍',
        'eco2025': '🎁 Економічний бонус: 350.000💵 (zv) + зниження боргу на 10% 📉',
        'PM0357101M': '🎁 Економічний бонус: 550.000💵 (vv) + 3 звичайних контейнерів 📦',
        'colek12': 'Колекційний предмет: "Сонячне ядро" ☀️',
        '0373380': '🎁 Економічний бонус: 350.000💵 (vv)',
        'COUNTRY2026': '🎁 Економічний бонус: 150.000💵 (zv) + Зимовий контейнер + Літній контейнер + Осінній контейнер + Весняний контейнер 🌸',
        'WORLDPOWER': '🎁 Економічний бонус: 500.000💵 (vv) + 10 танків 🛡️',
        'GLOBALSTART': 'Колекційний предмет "Небесна зірка" 🌟',
        'COUNTRYDRAGON': 'Вогняний дракон 🐉',
        'STRONGSTATE': 'Звичайний контейнер 📦 + Рідкисний контейнер + Епічний контейнер',
        'BONUS100': '⚔️ Бонус армії — +10 % до сили солдатів  + 🚀 Бонус швидкості — +10 % швидкості руху військ',
        'STARTBOOST': '📦 Бонус відкривання контейнерів x2',
        'MEGAREWARD': '🪨 1 тонна заліза + ⚙️ 1 тонна сталі + 🥉 1 тонна міді + 🥈 1 тонна срібла',
        'GOLDSTATE': '💰 Грошовий бокс I рівня + 💰 Грошовий бокс II рівня',
        'SECRETCOUNTRY': 'Колекційний предмет "Країна слави" 🏆',
        'ULTRABONUS': '🎁 Економічний бонус: 5.000.000💵 (vv)',
        'US_drog_8233353': 'Американський контейнер(5) 🗽 ',
        
        
    }

    if code in valid_codes:
        bot.send_message(message.chat.id, valid_codes[code])

    else:
        bot.send_message(message.chat.id, "❌ Невірний код. Спробуйте ще раз або перевірте правильність введення.")





bot.polling()